app/services/generate_experiments.rb

SELECT "devices".* FROM "devices" WHERE "devices"."device_token" = $1 LIMIT $2  [["device_token", "7a38d0a40d3bdb2b0a092bf19bdb3ca0"], ["LIMIT", 1]]
---
  def find_or_initialize_device
    @device = Device.find_or_initialize_by(device_token: device_token)

SELECT "options".* FROM "options" WHERE "options"."experiment_id" = $1  [["experiment_id", 33]]
INSERT INTO "device_options" ("option_id", "device_id") VALUES ($1, $2) RETURNING "id"  [["option_id", 144], ["device_id", 1]]
INSERT INTO "devices" ("device_token") VALUES ($1) RETURNING "id"  [["device_token", "a72b147f9840c740d78124820299a5d7"]]
---
  def store_device(device_numbers, experiment)
    experiment.options.each do |option|
      next if option_percent_riched?(device_numbers[option.id], option.percent)

      Device.transaction do
        device_numbers[option.id] += 1
        add_device_count
        Redis.current.set(experiment.name, device_numbers.to_json)
        DeviceOption.create(device_id: @device.id, option_id: option.id) if @device.save