app/views/statistics/index.html.slim

SELECT "options".* FROM "options" WHERE "options"."experiment_id" IN ($1, $2)  [["experiment_id", 59], ["experiment_id", 60]]
SELECT COUNT(*) FROM "devices" INNER JOIN "device_options" ON "devices"."id" = "device_options"."device_id" WHERE "device_options"."option_id" = $1  [["option_id", 158]]
---
        dl
          - experiment.options.each do |option|
            dt #{option.value}
            dd Devices percent: #{option.devices.count}%