app/models/option.rb

  def add_default_device_numbers
    experiment_number = Redis.current.get(self.experiment.name)
---
SELECT "experiments".* FROM "experiments" WHERE "experiments"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]